In [1]:
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import pandas as pd

%matplotlib inline

<H1>COVID-19 DATA ANALYSIS</H1>

The dashboard from hopkins it's great but it needs more drill down capabilites

Plan:
- Report all the cases, live update if possible
- Narrow down analysis to US
- Do a flow or kansey viz of spread path
- Compare confirmed cases to SARS
- Do a timelapse viz of infection / confirmed cases
- Try to get a news feed

<h3> Data Source</h3>

**John Hopkins official Data:**

John Hopkins Official GitHub:

https://github.com/CSSEGISandData/COVID-19

My Fork: 

https://github.com/FrankJLopez117/COVID-20

How to update:

https://gist.github.com/CristinaSolana/1885435

**SARS Outbreak Dataset:**

https://www.kaggle.com/imdevskp/sars-outbreak-2003-complete-dataset#sars_2003_complete_dataset_clean.csv

<h3> Data Prep</h3>

<h4>COVID-19 Data</h4>

In [2]:
#import the covid-19 data
corona_confirmed_ts_path = 'assets/COVID-20/csse_covid_19_data/csse_covid_19_time_series/time_series_19-covid-Confirmed.csv'
corona_confirmed_ts = pd.read_csv(corona_confirmed_ts_path)

corona_deaths_ts_path = 'assets/COVID-20/csse_covid_19_data/csse_covid_19_time_series/time_series_19-covid-Deaths.csv'
corona_deaths_ts = pd.read_csv(corona_deaths_ts_path)

corona_recovered_ts_path = 'assets/COVID-20/csse_covid_19_data/csse_covid_19_time_series/time_series_19-covid-Recovered.csv'
corona_recovered_ts = pd.read_csv(corona_recovered_ts_path)

In [3]:
#transform covid-19 data into tabular data

corona_confirmed = corona_confirmed_ts.melt(["Province/State", "Country/Region","Lat","Long"], var_name="Date", value_name="Confirmed")

corona_deaths = corona_deaths_ts.melt(["Province/State", "Country/Region","Lat","Long"], var_name="Date", value_name="Deaths")

corona_recovered = corona_recovered_ts.melt(["Province/State", "Country/Region","Lat","Long"], var_name="Date", value_name="Recovered")
corona_recovered

       Province/State Country/Region      Lat      Long     Date  Recovered
0                 NaN       Thailand  15.0000  101.0000  1/22/20          0
1                 NaN          Japan  36.0000  138.0000  1/22/20          0
2                 NaN      Singapore   1.2833  103.8333  1/22/20          0
3                 NaN          Nepal  28.1667   84.2500  1/22/20          0
4                 NaN       Malaysia   2.5000  112.5000  1/22/20          0
...               ...            ...      ...       ...      ...        ...
20701     Oakland, MI             US  42.5922  -83.3362  3/12/20          0
20702       Wayne, MI             US  42.2791  -83.3362  3/12/20          0
20703  New Castle, DE             US  39.5393  -75.6674  3/12/20          0
20704             NaN           Cuba  22.0000  -80.0000  3/12/20          0
20705             NaN         Guyana   5.0000  -58.7500  3/12/20          0

[20706 rows x 6 columns]

In [9]:
#Merge the confirmed,deaths, and recovered datasets
df = pd.merge(corona_confirmed,corona_deaths)
corona = pd.merge(df,corona_recovered)
corona.to_csv("test.csv")

In [10]:
Today = corona.loc[:,"Date"]=='3/12/20'  
corona[Today]

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths,Recovered
20300,NaN,Thailand,15.0000,101.0000,3/12/20,70,1,34
20301,NaN,Japan,36.0000,138.0000,3/12/20,639,16,118
20302,NaN,Singapore,1.2833,103.8333,3/12/20,178,0,96
20303,NaN,Nepal,28.1667,84.2500,3/12/20,1,0,1
20304,NaN,Malaysia,2.5000,112.5000,3/12/20,149,0,26
...,...,...,...,...,...,...,...,...
20701,"Oakland, MI",US,42.5922,-83.3362,3/12/20,0,0,0
20702,"Wayne, MI",US,42.2791,-83.3362,3/12/20,0,0,0
20703,"New Castle, DE",US,39.5393,-75.6674,3/12/20,0,0,0
20704,NaN,Cuba,22.0000,-80.0000,3/12/20,3,0,0
20705,NaN,Guyana,5.0000,-58.7500,3/12/20,1,1,0

<h4>2003 SARS Outbreak</h4>

In [19]:
#import the covid-19 data
sars2003_path = 'assets/sars-outbreak-2003-complete-dataset/sars_2003_complete_dataset_clean.csv'
sars2003 = pd.read_csv(sars2003_path)

In [20]:
sars2003

,Date,Country,Cumulative number of case(s),Number of deaths,Number recovered
0,2003-03-17,Germany,1,0,0
1,2003-03-17,Canada,8,2,0
2,2003-03-17,Singapore,20,0,0
3,2003-03-17,"Hong Kong SAR, China",95,1,0
4,2003-03-17,Switzerland,2,0,0
...,...,...,...,...,...
2533,2003-07-11,Switzerland,1,0,1
2534,2003-07-11,Thailand,9,2,7
2535,2003-07-11,United Kingdom,4,0,4
2536,2003-07-11,United States,75,0,67
2537,2003-07-11,Viet Nam,63,5,58

In [21]:
sars2003.columns

Index(['Date', 'Country', 'Cumulative number of case(s)', 'Number of deaths',
       'Number recovered'],
      dtype='object')

In [24]:
sars2003 = sars2003.rename(columns={"Cumulative number of case(s)":"Confirmed", 'Number of deaths':'Deaths', 'Number recovered':'Recovered'})
sars2003

            Date               Country  Confirmed  Deaths  Recovered
0     2003-03-17               Germany          1       0          0
1     2003-03-17                Canada          8       2          0
2     2003-03-17             Singapore         20       0          0
3     2003-03-17  Hong Kong SAR, China         95       1          0
4     2003-03-17           Switzerland          2       0          0
...          ...                   ...        ...     ...        ...
2533  2003-07-11           Switzerland          1       0          1
2534  2003-07-11              Thailand          9       2          7
2535  2003-07-11        United Kingdom          4       0          4
2536  2003-07-11         United States         75       0         67
2537  2003-07-11              Viet Nam         63       5         58

[2538 rows x 5 columns]

<h4> Combine the two datsets </h4>